---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsDeleted
source: html/6f857b96-844d-2f93-1fb9-ae650f372de2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.ElementsDeleted Property

Elements were deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsDeleted { get; }
```